; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	infrared5 - mode
	image4 - mode
	spectrograph3 - mode
	spectrograph6 - mode
	spectrograph2 - mode
	image1 - mode
	thermograph0 - mode
	Star1 - direction
	Star3 - direction
	GroundStation4 - direction
	GroundStation2 - direction
	Star0 - direction
	Star5 - direction
	Star6 - direction
	Star7 - direction
	Phenomenon8 - direction
	Star9 - direction
)
(:init
	(supports instrument0 image4)
	(supports instrument0 spectrograph2)
	(calibration_target instrument0 GroundStation2)
	(supports instrument1 spectrograph3)
	(supports instrument1 infrared5)
	(supports instrument1 thermograph0)
	(supports instrument1 spectrograph6)
	(calibration_target instrument1 Star0)
	(supports instrument2 image1)
	(supports instrument2 infrared5)
	(calibration_target instrument2 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation4)
)
(:goal (and
	(pointing satellite0 Star1)
	(have_image Star5 spectrograph6)
	(have_image Star5 image1)
	(have_image Star6 spectrograph3)
	(have_image Star6 image4)
	(have_image Star7 thermograph0)
	(have_image Star7 spectrograph6)
	(have_image Phenomenon8 image1)
	(have_image Star9 image4)
	(have_image Star9 spectrograph6)
))

)

; plan
1. (turn_to satellite0 star0 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 star0)
   goals met: 0 of 10
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 10
3. (calibrate satellite0 instrument1 star0)
   added: (calibrated instrument1)
   goals met: 0 of 10
4. (turn_to satellite0 star9 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star9)
   goals met: 0 of 10
5. (take_image satellite0 star9 instrument1 spectrograph6)
   added: (have_image star9 spectrograph6)
   goals met: 1 of 10
6. (turn_to satellite0 star7 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 star7)
   goals met: 1 of 10
7. (take_image satellite0 star7 instrument1 thermograph0)
   added: (have_image star7 thermograph0)
   goals met: 2 of 10
8. (take_image satellite0 star7 instrument1 spectrograph6)
   added: (have_image star7 spectrograph6)
   goals met: 3 of 10
9. (turn_to satellite0 star6 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star6)
   goals met: 3 of 10
10. (take_image satellite0 star6 instrument1 spectrograph3)
   added: (have_image star6 spectrograph3)
   goals met: 4 of 10
11. (turn_to satellite0 star5 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 star5)
   goals met: 4 of 10
12. (take_image satellite0 star5 instrument1 spectrograph6)
   added: (have_image star5 spectrograph6)
   goals met: 5 of 10
13. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 5 of 10
14. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 5 of 10
15. (turn_to satellite0 groundstation2 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 groundstation2)
   goals met: 5 of 10
16. (calibrate satellite0 instrument0 groundstation2)
   added: (calibrated instrument0)
   goals met: 5 of 10
17. (turn_to satellite0 star6 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 star6)
   goals met: 5 of 10
18. (take_image satellite0 star6 instrument0 image4)
   added: (have_image star6 image4)
   goals met: 6 of 10
19. (turn_to satellite0 star9 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 star9)
   goals met: 6 of 10
20. (take_image satellite0 star9 instrument0 image4)
   added: (have_image star9 image4)
   goals met: 7 of 10
21. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 7 of 10
22. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 7 of 10
23. (turn_to satellite0 star0 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 star0)
   goals met: 7 of 10
24. (calibrate satellite0 instrument2 star0)
   added: (calibrated instrument2)
   goals met: 7 of 10
25. (turn_to satellite0 phenomenon8 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 phenomenon8)
   goals met: 7 of 10
26. (take_image satellite0 phenomenon8 instrument2 image1)
   added: (have_image phenomenon8 image1)
   goals met: 8 of 10
27. (turn_to satellite0 star5 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 star5)
   goals met: 8 of 10
28. (take_image satellite0 star5 instrument2 image1)
   added: (have_image star5 image1)
   goals met: 9 of 10
29. (turn_to satellite0 star1 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 star1)
   goals met: 10 of 10
